//WhatWeNeedToDo

//Сделать так,чтобы версии зависимостей были в верхней части pom файла
//Сделать конвертер TimeStamp в LocalDate пока оставлено java.util.date
//Поправить пути к header и footer (исправлено)



//-Возможность "батчево-транзакционной" загрузки операций через входящий xml/json файл .
// Т.е. в файле от 1 до 1000 операций, и надо загрузить либо все операции, либо ни одной , если какая-то операция невозможна.
//-Настроить логирование программы с профилями "дебаг" и "продакшн".
// Подразумевается, что "поддержка" могла заглянуть в логи и посмотреть, как проходят операции.
// Либо же выгрузить лог "вам".



//
//Основные проблемы
//1)Сделать взаимодействие с другим банком
//2)Логирование
//3)Обработка JSON на стороне клиента
//
//Мелкие проблемы
//1)Документация
//2)Рефакторинг кода
//    1)Имена функций переменных
//    2)Попраить кнопки и страницы
//    3)Избавиться от варнингов
//3)Разобраться что с Hibernate
//4)Убрать лишнии фвйлы с Git
//5)Структура файлов
//
//Конец
//Поставить все на сервак и поднять бд


//Подает если неверный номер телефона
//Не обновляет данные Пример, перевод денег, но не добавляется в транзакции


// сделать проверку на кнопке перевод
// сделать кнопку пополнить для своих счетов
